#include <car.h>
#include <speed_control.h>

void auto_ctrl ()
{
    if ((TR10==0 && TR20==1 && TR30==1 && TR40==0) || (TR10==1 && TR20==1 && TR30==1 && TR40==1))   //检测在轨，直行
    {
        straight(70);
    }
    if (TR10==0 && TR20==0 && TR30==1 && TR40==0)   //检测到行驶偏右，向左偏航
    {
        turn_right(20,500);
        if (TR10==0 && TR20==0 && TR30==0 && TR40==0)   //防抖
        {
            straight(70);
        }
    }
    if (TR10==0 && TR20==1 && TR30==0 && TR40==0)   //检测到行驶偏右，向左偏航
    {
        turn_left(20,500);
        if (TR10==0 && TR20==0 && TR30==0 && TR40==0)   //防抖
        {
            straight(70);
        }
    }
    if ((TR10==1 && TR20==0 && TR30==0 && TR40==0) || (TR10==1 && TR20==1 && TR30==0 && TR40==0) || (TR10==1 && TR20==1 && TR30==1 && TR40==0) || (TR10==1 && TR20==0 && TR30==1 && TR40==0))   //检测到轨道较大角度左转，小车左转(如有必要，此处可拆分为多个判断条件，对应多种转向方法)
    {
        stop(100);
        turn_left(37,640);
    }
    if ((TR10==0 && TR20==0 && TR30==0 && TR40==1) || (TR10==0 && TR20==0 && TR30==1 && TR40==1) || (TR10==0 && TR20==1 && TR30==1 && TR40==1) || (TR10==0 && TR20==1 && TR30==0 && TR40==1))   //检测到轨道较大角度右转，小车右转(如有必要，此处可拆分为多个判断条件，对应多种转向方法)
    {
        stop(100);
        turn_right(37,640);
    }
    if (ST0==1)   //检测到障碍物，绕开
    {
        turn_right(25,500);
        turn_left(25,500);
    }
}